blogs/app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
		<p>Content: <%= post.content %></p>
		<p>Written By: <%= post.user.firstname %></p>