blogs/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		puts "yo, we did it"
		@users = User.all