blogs/app/views/blogs/index.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."blog_id" = ?  ORDER BY "posts"."id" DESC LIMIT 1  [["blog_id", 1]]
---
				<td> <%= blog.desc %> </td>
					<% if blog.posts.last === nil %>